{
  "events": [
    {
      "id": "birthdays",
      "name": "Birthdays",
      "description": "Celebrate another year of life with our delicious homemade treats and custom cakes. From intimate family gatherings to milestone celebrations, we'll make your special day unforgettable with fresh-baked goodies and personalized service.",
      "customization": "Kim is available to customize your menu for any birthday celebration, ensuring every detail is perfect for your special day."
    },
    {
      "id": "corporate-lunches",
      "name": "Corporate Lunches",
      "description": "Impress your clients and colleagues with our professional Catering services. Perfect for business meetings, conferences, and corporate events. We provide fresh, delicious meals that keep your team energized and focused."
    },
    {
      "id": "corporate-specials",
      "name": "Corporate Specials",
      "description": "Elevate your corporate events with our premium Catering packages. From executive dinners to company celebrations, we offer sophisticated menus and impeccable service that reflects your company's standards."
    },
    {
      "id": "family-reunions",
      "name": "Family Reunions",
      "description": "Bring the whole family together with our heartwarming homemade dishes. Perfect for large gatherings, we provide comfort food that reminds everyone of home and creates lasting memories around the dinner table.",
      "customization": "Kim is available to customize your menu for family reunions, ensuring every family member's preferences are considered."
    },
    {
      "id": "fundraisers",
      "name": "Fundraisers",
      "description": "Support your cause with our community-focused Catering. We're proud to help local organizations and charities with delicious food that brings people together for a good cause. Special rates available for non-profit events."
    },
    {
      "id": "funerals",
      "name": "Funerals",
      "description": "Honor your loved one's memory with our respectful and comforting Catering services. We provide gentle, nourishing meals for families during difficult times, allowing you to focus on what matters most while we take care of the details.",
      "specialPricing": "Special funeral and celebration of life pricing available",
      "menus": [
        {
          "name": "Menu 1",
          "description": "Open faced buns - chicken, egg, ham salad, ham & cheese. Fresh veggies and dip, pickles, assorted homemade squares and cookies. Disposable napkins and dishes included.",
          "price": "$6.00 plus GST"
        },
        {
          "name": "Menu 2", 
          "description": "Assorted sandwiches including wraps, croissants, ciabatta buns, whole wheat bread. Variety includes ham and swiss, veggie wraps, chicken salad, montreal beef with havarti, chicken BLT, egg and ham salad. Fresh Veggie and Fruit Trays with dip, pickle tray, homemade squares and cookies. Coffee, tea, and punch included. Disposable napkins and dishes.",
          "price": "$7.50 plus GST"
        },
        {
          "name": "Menu 3",
          "description": "Gourmet meat and cheese tray with assorted crackers, pickle tray, veggies and dip, fresh fruit and dip, assorted spiral appetizers, finger sandwiches, homemade squares, tarts and cookies. Coffee, tea and punch included. Disposable dishes and napkins.",
          "price": "$8.50 plus GST"
        }
      ]
    },
    {
      "id": "rental-space",
      "name": "Rental Space",
      "description": "Host your event in our beautiful new cafe space. Perfect for intimate gatherings, business meetings, or special celebrations with a warm, welcoming atmosphere.",
      "capacity": "Up to 70 people",
      "pricing": "Contact Kim for rental pricing details"
    },
    {
      "id": "special-events",
      "name": "Special Events",
      "description": "Make any occasion extraordinary with our custom Catering solutions. Whether it's an anniversary, graduation, retirement party, or any other milestone, we'll create a memorable dining experience tailored to your unique celebration.",
      "customization": "Kim is available to customize your menu for any special event, ensuring every detail reflects your vision."
    },
    {
      "id": "weddings",
      "name": "Weddings",
      "description": "Make your special day absolutely perfect with our romantic and elegant wedding Catering. From intimate ceremonies to grand receptions, we create beautiful, delicious experiences that you and your guests will treasure forever.",
      "specialServices": [
        "Wedding cake coordination through Amber's Photography",
        "Head table service at no additional charge",
        "Wedding cake cutting and serving included",
        "Punch refills throughout the event"
      ],
      "customization": "Kim is available to customize your wedding menu, ensuring every detail is perfect for your special day."
    }
  ],
  "generalInfo": {
    "philosophy": "Kim's Catering takes pride in making your event memorable for all to enjoy. We plan, prepare and serve to take the worries off your hands and into ours.",
    "customization": "Whether it's a birthday, anniversary, family reunion, or any special occasion, Kim is available to customize your menu to perfectly suit your needs.",
    "specialtyItems": "Kim's Cafe and Catering offers specialty items including custom cakes, fruit and baking baskets, and other unique treats.",
    "contact": "For pricing on menu additions or any questions, please contact Kim at 403-497-9338"
  }
}
